Evaluations/perf_testing/data/composePost/202404261246_200_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 123.331ms, rate sampling interval: 367ms
  Thread calibration: mean lat.: 126.705ms, rate sampling interval: 377ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   782.47ms    2.02s    9.59s    90.41%
    Req/Sec    97.86     44.38   172.00     72.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  103.29ms
 75.000%  165.63ms
 90.000%    2.49s 
 99.000%    9.59s 
 99.900%   10.03s 
 99.990%   10.04s 
 99.999%   10.04s 
100.000%   10.04s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.599     0.000000            1         1.00
      87.807     0.100000          394         1.11
      91.775     0.200000          783         1.25
      95.231     0.300000         1178         1.43
      99.007     0.400000         1570         1.67
     103.295     0.500000         1956         2.00
     107.071     0.550000         2153         2.22
     116.287     0.600000         2348         2.50
     128.895     0.650000         2543         2.86
     145.023     0.700000         2739         3.33
     165.631     0.750000         2934         4.00
     178.431     0.775000         3032         4.44
     193.023     0.800000         3129         5.00
     211.839     0.825000         3228         5.71
     237.439     0.850000         3325         6.67
     452.351     0.875000         3423         8.00
    1397.759     0.887500         3472         8.89
    2486.271     0.900000         3520        10.00
    3422.207     0.912500         3570        11.43
    4415.487     0.925000         3618        13.33
    5488.639     0.937500         3667        16.00
    5959.679     0.943750         3692        17.78
    6385.663     0.950000         3716        20.00
    7057.407     0.956250         3740        22.86
    7507.967     0.962500         3766        26.67
    7929.855     0.968750         3789        32.00
    8310.783     0.971875         3802        35.56
    8339.455     0.975000         3814        40.00
    8740.863     0.978125         3826        45.71
    8765.439     0.981250         3838        53.33
    9166.847     0.984375         3850        64.00
    9183.231     0.985938         3859        71.11
    9215.999     0.987500         3863        80.00
    9592.831     0.989062         3873        91.43
    9601.023     0.990625         3881       106.67
    9601.023     0.992188         3881       128.00
    9625.599     0.992969         3884       142.22
    9674.751     0.993750         3887       160.00
   10018.815     0.994531         3901       182.86
   10018.815     0.995313         3901       213.33
   10018.815     0.996094         3901       256.00
   10018.815     0.996484         3901       284.44
   10018.815     0.996875         3901       320.00
   10018.815     0.997266         3901       365.71
   10027.007     0.997656         3910       426.67
   10027.007     0.998047         3910       512.00
   10027.007     0.998242         3910       568.89
   10027.007     0.998437         3910       640.00
   10027.007     0.998633         3910       731.43
   10027.007     0.998828         3910       853.33
   10027.007     0.999023         3910      1024.00
   10027.007     0.999121         3910      1137.78
   10027.007     0.999219         3910      1280.00
   10027.007     0.999316         3910      1462.86
   10027.007     0.999414         3910      1706.67
   10027.007     0.999512         3910      2048.00
   10027.007     0.999561         3910      2275.56
   10027.007     0.999609         3910      2560.00
   10027.007     0.999658         3910      2925.71
   10027.007     0.999707         3910      3413.33
   10035.199     0.999756         3911      4096.00
   10035.199     1.000000         3911          inf
#[Mean    =      782.474, StdDeviation   =     2022.740]
#[Max     =    10027.008, Total count    =         3911]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5640 requests in 30.05s, 1.53MB read
  Non-2xx or 3xx responses: 47
Requests/sec:    187.68  
Transfer/sec:     52.05KB