Evaluations/perf_testing/data/composePost/202404261247_300_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 119.644ms, rate sampling interval: 347ms
  Thread calibration: mean lat.: 111.772ms, rate sampling interval: 297ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.14s     2.72s   10.05s    88.09%
    Req/Sec   141.47     45.30   280.00     73.39%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  106.11ms
 75.000%  222.72ms
 90.000%    5.25s 
 99.000%   10.05s 
 99.900%   17.63s 
 99.990%   18.45s 
 99.999%   18.68s 
100.000%   18.68s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      13.807     0.000000            1         1.00
      87.935     0.100000          568         1.11
      92.223     0.200000         1135         1.25
      96.063     0.300000         1699         1.43
      99.711     0.400000         2267         1.67
     106.111     0.500000         2826         2.00
     114.303     0.550000         3105         2.22
     132.479     0.600000         3387         2.50
     149.759     0.650000         3669         2.86
     173.055     0.700000         3951         3.33
     222.719     0.750000         4233         4.00
     245.375     0.775000         4375         4.44
     273.407     0.800000         4516         5.00
     319.231     0.825000         4657         5.71
     968.703     0.850000         4798         6.67
    3422.207     0.875000         4939         8.00
    4431.871     0.887500         5010         8.89
    5246.975     0.900000         5080        10.00
    6045.695     0.912500         5151        11.43
    6823.935     0.925000         5221        13.33
    7610.367     0.937500         5293        16.00
    7995.391     0.943750         5327        17.78
    8339.455     0.950000         5364        20.00
    8691.711     0.956250         5398        22.86
    9003.007     0.962500         5436        26.67
    9256.959     0.968750         5470        32.00
    9322.495     0.971875         5487        35.56
    9510.911     0.975000         5505        40.00
    9584.639     0.978125         5521        45.71
    9764.863     0.981250         5539        53.33
    9863.167     0.984375         5556        64.00
   10018.815     0.985938         5578        71.11
   10018.815     0.987500         5578        80.00
   10027.007     0.989062         5584        91.43
   12492.799     0.990625         5592       106.67
   13516.799     0.992188         5600       128.00
   13860.863     0.992969         5605       142.22
   14114.815     0.993750         5609       160.00
   14499.839     0.994531         5614       182.86
   14778.367     0.995313         5618       213.33
   15245.311     0.996094         5622       256.00
   15491.071     0.996484         5625       284.44
   15745.023     0.996875         5627       320.00
   15998.975     0.997266         5629       365.71
   16244.735     0.997656         5631       426.67
   16547.839     0.998047         5633       512.00
   17055.743     0.998242         5635       568.89
   17301.503     0.998437         5636       640.00
   17514.495     0.998633         5637       731.43
   17629.183     0.998828         5638       853.33
   17743.871     0.999023         5639      1024.00
   17891.327     0.999121         5640      1137.78
   17891.327     0.999219         5640      1280.00
   17989.631     0.999316         5641      1462.86
   17989.631     0.999414         5641      1706.67
   18186.239     0.999512         5642      2048.00
   18186.239     0.999561         5642      2275.56
   18186.239     0.999609         5642      2560.00
   18448.383     0.999658         5643      2925.71
   18448.383     0.999707         5643      3413.33
   18448.383     0.999756         5643      4096.00
   18448.383     0.999780         5643      4551.11
   18448.383     0.999805         5643      5120.00
   18677.759     0.999829         5644      5851.43
   18677.759     1.000000         5644          inf
#[Mean    =     1138.255, StdDeviation   =     2721.909]
#[Max     =    18661.376, Total count    =         5644]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  8435 requests in 30.02s, 2.28MB read
  Non-2xx or 3xx responses: 45
Requests/sec:    281.00  
Transfer/sec:     77.91KB