Evaluations/perf_testing/data/composePost/202404261248_350_30s.txt
Running 30s test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 112.481ms, rate sampling interval: 312ms
  Thread calibration: mean lat.: 115.823ms, rate sampling interval: 325ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.08s     2.37s    9.67s    87.14%
    Req/Sec   170.74     41.06   278.00     68.55%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  104.89ms
 75.000%  182.91ms
 90.000%    4.97s 
 99.000%    9.67s 
 99.900%   10.03s 
 99.990%   10.04s 
 99.999%   10.05s 
100.000%   10.05s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      15.039     0.000000            1         1.00
      88.639     0.100000          682         1.11
      92.735     0.200000         1362         1.25
      96.063     0.300000         2044         1.43
      99.967     0.400000         2723         1.67
     104.895     0.500000         3410         2.00
     109.375     0.550000         3747         2.22
     118.847     0.600000         4085         2.50
     136.703     0.650000         4426         2.86
     159.999     0.700000         4765         3.33
     182.911     0.750000         5106         4.00
     201.855     0.775000         5275         4.44
     238.975     0.800000         5446         5.00
     770.047     0.825000         5615         5.71
    2301.951     0.850000         5786         6.67
    3645.439     0.875000         5956         8.00
    4317.183     0.887500         6041         8.89
    4984.831     0.900000         6127        10.00
    5644.287     0.912500         6211        11.43
    6303.743     0.925000         6297        13.33
    6975.487     0.937500         6381        16.00
    7290.879     0.943750         6424        17.78
    7659.519     0.950000         6466        20.00
    7987.199     0.956250         6509        22.86
    8306.687     0.962500         6551        26.67
    8650.751     0.968750         6594        32.00
    8830.975     0.971875         6616        35.56
    8929.279     0.975000         6636        40.00
    9125.887     0.978125         6658        45.71
    9289.727     0.981250         6680        53.33
    9428.991     0.984375         6700        64.00
    9494.527     0.985938         6713        71.11
    9519.103     0.987500         6721        80.00
    9633.791     0.989062         6732        91.43
    9707.519     0.990625         6743       106.67
    9805.823     0.992188         6756       128.00
    9822.207     0.992969         6759       142.22
    9838.591     0.993750         6765       160.00
    9863.167     0.994531         6769       182.86
    9936.895     0.995313         6775       213.33
   10018.815     0.996094         6792       256.00
   10018.815     0.996484         6792       284.44
   10018.815     0.996875         6792       320.00
   10018.815     0.997266         6792       365.71
   10018.815     0.997656         6792       426.67
   10027.007     0.998047         6802       512.00
   10027.007     0.998242         6802       568.89
   10027.007     0.998437         6802       640.00
   10027.007     0.998633         6802       731.43
   10027.007     0.998828         6802       853.33
   10027.007     0.999023         6802      1024.00
   10027.007     0.999121         6802      1137.78
   10027.007     0.999219         6802      1280.00
   10027.007     0.999316         6802      1462.86
   10035.199     0.999414         6805      1706.67
   10035.199     0.999512         6805      2048.00
   10035.199     0.999561         6805      2275.56
   10035.199     0.999609         6805      2560.00
   10035.199     0.999658         6805      2925.71
   10035.199     0.999707         6805      3413.33
   10035.199     0.999756         6805      4096.00
   10035.199     0.999780         6805      4551.11
   10035.199     0.999805         6805      5120.00
   10035.199     0.999829         6805      5851.43
   10051.583     0.999854         6806      6826.67
   10051.583     1.000000         6806          inf
#[Mean    =     1083.132, StdDeviation   =     2374.610]
#[Max     =    10043.392, Total count    =         6806]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  10083 requests in 30.02s, 2.73MB read
  Non-2xx or 3xx responses: 34
Requests/sec:    335.83  
Transfer/sec:     93.02KB